---
kind: method
id: M:Autodesk.Revit.DB.ExportFontTable.GetEnumerator
source: html/2e33c911-e7a0-b797-00e5-16b8a3747903.htm
---
# Autodesk.Revit.DB.ExportFontTable.GetEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
public virtual IEnumerator<KeyValuePair<ExportFontKey, ExportFontInfo>> GetEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.